Repository: beatkhor/frontend
Catalog: apps/beatkhor/src/locale/messages.*.xlf
Languages: fa_ir

source: Browse
fa_ir: جستجو

source: Upload
fa_ir: آپلود بیت

source: Review tracks
fa_ir: بررسی آثار

source: Sign in
fa_ir: ورود

source: Sign up
fa_ir: ثبت نام

source: Setup your profile
fa_ir: تکمیل پروفایل

source: Password recovery
fa_ir: بازنشانی رمز عبور

source: Reset password
fa_ir: تغییر رمز عبور

source: Social media
fa_ir: شبکه‌های اجتماعی

source: Telegram
fa_ir: تلگرام

source: Track
fa_ir: ‌بیت

source: Page
fa_ir: صفحه

source: Beatkhor
fa_ir: بیت‌خور

source: cover art
fa_ir: تصویر جلد

source: cover art
fa_ir: تصویر جلد

source: Beatkhor [Next]
fa_ir: بیتخور (آزمایشی)

source: Useful links
fa_ir: لینک‌های مفید

source: Browse
fa_ir: جستجو

source: About
fa_ir: درباره

source: Our mission
fa_ir: ماموریت ما

# missionDescription
source: Since 2017, Beatkhor aims to promote creativity and accelerate the development of the music culture. All the beats are made by the beatkhor community.
fa_ir: از سال ۲۰۱۷، بیت‌خور به هدف ترویج خلاقیت و شتاب دادن به توسعه فرهنگ موسیقی اشتغال دارد. همه بیت‌ها توسط جامعه بیت‌خور ساخته شده‌اند.

source: Beatkhor
fa_ir: بیت‌‌خور

source: Sign in
fa_ir: ورود

source: Get Started
fa_ir: ثبت نام

source: Upload
fa_ir: آپلود

source: Sign out
fa_ir: خروج

source: Sign out
fa_ir: خروج

source: Are you sure about signing out of your account?
fa_ir: آیا از خروج از حساب کاربری خود مطمئن هستید؟

source: You need to sign in to access this section!
fa_ir: برای دسترسی به این بخش، باید وارد شوید!

# setupProfileTitle
source: Setup your profile
fa_ir: پروفایل خود را کامل کنید

# setupProfilePrompt
source: Now it's time to setup your beatkhor profile. Please provide the details below and choose a unique username for yourself.
fa_ir: حالا زمان تنظیم پروفایل بیت‌خور شماست. لطفاً جزئیات زیر را وارد کنید و یک نام کاربری منحصر به فرد برای خود انتخاب کنید.

source: First name
fa_ir: نام

# firstNameHint
source: Will be displayed on public profile
fa_ir: در پروفایل عمومی نمایش داده خواهد شد

# firstNameRequired
source: Please enter your first name
fa_ir: لطفا نام خود را وارد کنید.

source: Username
fa_ir: نام کاربری

# usernameMinLengthError
source: Username should be at least 4 characters.
fa_ir: نام کاربری باید حداقل دارای ۴ کاراکتر باشد.

# usernameInvalidError
source: Username can only have a-z and 0-9 characters
fa_ir: نام کاربری می‌تواند تنها شامل اعداد و حروف انگلیسی باشد.

# setupProfileUsernameHint
source: Username can only have a-z and 0-9
fa_ir: نام کاربری می‌تواند تنها شامل اعداد و حروف انگلیسی باشد.

# usernameAvailable
source: Cool, this username is available!
fa_ir: عالی! نام کاربری در دسترس است.

# usernameUnavailable
source: This username is taken! Try something else.
fa_ir: این نام کاربری قبلا استفاده شده است!

source: Please wait...
fa_ir: لطفا صبر کنید...

source: Continue
fa_ir: ادامه

# resetRequestTitle
source: Password recovery
fa_ir: بازیابی رمز عبور

# resetRequestPrompt
source: No worries! Just enter your email to reset your account password. We will send you an email with the link to choose a new password.
fa_ir: کافیست ایمیل خود را وارد کنید تا رمز حساب کاربری خود را تغییر دهید. ما به شما یک ایمیل با لینک برای انتخاب یک رمز عبور جدید ارسال خواهیم کرد.

source: Email
fa_ir: ایمیل

# resetRequestEmailHint
source: Enter your email to receive the instructions
fa_ir: برای دریافت لینک ایمیل خود را وارد کنید.

# emailRequiredError
source: Please enter your email!
fa_ir: لطفا ایمیل خود را وارد کنید.

# emailInvalidError
source: Please enter a valid email!
fa_ir: لطفا یک ایمیل معتبر وارد کنید.

# resetRequestCTA
source: Recover my password
fa_ir: بازنشانی رمز عبور

# resetRequestDoneTitle
source: Check Your Email
fa_ir: ایمیل ارسال شد

# resetRequestDonePrompt1
source: Perfect! We just sent you an email that contains the instructions for choosing a new password.
fa_ir: عالی! ما به شما یک ایمیل شامل لینک بازنشانی رمز عبور ارسال کردیم..

# resetRequestDonePrompt2
source: You will not receive an email if you don't already have an account connected to this email
fa_ir: اگر از پیش حساب کاربری مرتبط با این ایمیل نداشته باشید، ایمیلی دریافت نخواهید کرد.

source: Go back
fa_ir: بازگشت

source: Reset password
fa_ir: تغییر رمز عبور

# resetPasswordPrompt
source: Now you can choose a brand new password for your beatkhor account.
fa_ir: حالا می‌توانید یک رمز عبور کاملاً جدید برای حساب کاربری بیت‌خور خود انتخاب کنید.

source: New password
fa_ir: رمز عبور جدید

# newPasswordHint
source: A password should include at least 6 characters.
fa_ir: رمز عبور باید حداقل دارای ۶ کاراکتر باشد.

# newPasswordError
source: Please enter at least 6 characters!
fa_ir: لطفا حداقل ۶ کاراکتر وارد کنید.

source: Confirm password
fa_ir: تکرار رمز عبور

# confirmPasswordHint
source: Please type your password again to confirm
fa_ir: لطفا رمز عبور خود را دوباره وارد کنید

# confirmPasswordMismatchError
source: The passwords do not match together
fa_ir: رمز عبور‌ها همخوانی ندارند!

# confirmPasswordRequiredError
source: Please re-enter your password
fa_ir: لطفا رمز عبور خود را دوباره وارد کنید

# resetPasswordCTA
source: Reset password
fa_ir: تغییر رمز عبور

source: Home page
fa_ir: خانه

# resetDoneTitle
source: Your password is changed
fa_ir: رمز عبور تغییر کرد

# resetDonePrompt
source: Perfect! We changed your password. Go ahead and sign in using your new password.
fa_ir: عالی! رمز عبور شما تغییر کرد. حالا می‌توانید با استفاده از رمز عبور جدید خود وارد شوید.

# signInTitle
source: Welcome back!
fa_ir: خوش آمدید!

# signInPrompt
source: Please provide your email and password to sign into your account.
fa_ir: لطفاً برای ورود به حساب کاربری خود، ایمیل و رمز عبور خود را وارد کنید.

# emailOrUsername
source: Email / Username
fa_ir: ایمیل / نام کاربری

# emailOrUsernameHint
source: You can use your username or email to sign in
fa_ir: برای ورود می‌توانید از ایمیل یا نام کاربری خود استفاده کنید.

# emailOrUsernameRequiredError
source: Please enter your email or username!
fa_ir: لطفا ایمیل یا نام کاربری خود را وارد کنید.

source: Password
fa_ir: رمز عبور

# passwordHint
source: A password should include at least 6 characters.
fa_ir: رمز عبور باید حداقل دارای ۶ کاراکتر باشد.

# passwordRequiredError
source: Please enter at least 6 characters!
fa_ir: لطفا حداقل ۶ کاراکتر وارد کنید.

# signUpHelper
source: Don't have a account yet?
fa_ir: حساب کاربری ندارید؟

source: sign up now!
fa_ir: ثبت نام کنید

# forgotPasswordHelper
source: If you have forgotten your password, you can easily
fa_ir: رمز عبور خود را فراموش کرده‌اید؟

# recoverPasswordHere
source: recover your password here
fa_ir: بازنشانی کنید

# signUpTitle
source: Sign up
fa_ir: ثبت نام

# signUpPrompt
source: Welcome to Beatkhor. Please fill this form to create a shiny new account.
fa_ir: به بیت‌خور خوش‌آمدید! لطفا برای ساختن حساب کاربری جدید جزئیات زیر را وارد کنید.

# signUpEmailHint
source: We will send the activation link to this email.
fa_ir: لینک فعالسازی به این ایمیل ارسال خواهد شد.

# passwordInvalid
source: Please enter at least 6 characters!
fa_ir: لطفا حداقل ۶ کاراکتر وارد کنید.

source: Sign up
fa_ir: ثبت نام

# signInHelper
source: Already have an account?
fa_ir: حساب کاربری دارید؟

# signInNowCTA
source: sign in now!
fa_ir: وارد شوید

# passwordRecoveryHelper
source: Have an account and forgotten your password? you can easily
fa_ir: حساب کاربری دارید و رمز عبور آن را فراموش کرده‌اید؟

# recoverPasswordNowCTA
source: recover your password here
fa_ir: بازنشانی کنید

# signUpDoneTitle
source: One More Step...
fa_ir: یک قدم دیگر...

# signUpDonePrompt
source: Congrats! We just sent you an email that contains the verification link. You can sign in after activating your account.
fa_ir: تبریک! ما به تازگی یک ایمیل به شما ارسال کردیم که حاوی لینک تأیید است. شما می‌توانید پس از فعال‌سازی حساب کاربری خود وارد شوید.

source: Please fill the form with valid information!
fa_ir: لطفا فرم را با اطلاعات معتبر پر کنید.

source: 'This email is already used by an account!
fa_ir: 'این ایمیل قبلا توسط یک حساب کاربری استفاده شده است!

source: OK
fa_ir: تایید

# searchBoxPlaceHolder
source: Browse tracks...
fa_ir: جستجوی بیت‌ها...

# genreFilterLabel
source: Choose genres
fa_ir: انتخاب ژانر‌ها

source: Genres
fa_ir: ژانر‌ها

# genreFilterPlaceholder
source: Choose a genre
fa_ir: انتخاب ژانر

# tagFilterLabel
source: Choose tags
fa_ir: انتخاب ویژگی‌ها

source: Tags
fa_ir: ویژگی‌ها

# tagFilterPlaceholder
source: Choose a tag
fa_ir: انتخاب ویژگی

source: Load more
fa_ir: بیشتر

source: Genre
fa_ir: ژانر

source: Tag
fa_ir: ویژگی

source: Download
fa_ir: دانلود

source: Recent related tracks
fa_ir: بیت‌های مرتبط جدید

source: We promote
fa_ir: سکوی پرتاب

# websiteDescription
source: Beatkhor is a community based platform to discover, publish and download free beats. Start browsing or upload your beat right now!
fa_ir: بیت‌خور یک پلتفرم مبتنی بر جامعه است که به شما امکان می‌دهد بیت‌های رایگان را کشف، منتشر و دانلود کنید. همین الان شروع به جستجو یا آپلود بیت‌های خود کنید!

# browseCTA
source: Browse Tracks
fa_ir: جستجوی بیت‌ها

# callbackAccountActivated
source: Awesome, your account is now activated!
fa_ir: عالی، حساب کاربری شما فعال شده است!

# callbackAccountActivationFailed
source: OOps, We could not activate your account! Please contact the support.
fa_ir: ما نتوانستیم حساب کاربری شما را فعال کنیم! لطفاً با پشتیبانی تماس بگیرید.

# callbackPasswordRecoveryVerificationFailed
source: We could not verify the password recovery link! Please contact the support.
fa_ir: ما نتوانستیم لینک بازیابی رمز عبور را تأیید کنیم! لطفاً با پشتیبانی تماس بگیرید.

source: Recommended Tracks
fa_ir: بیت‌های پیشنهادی

source: View More
fa_ir: بیشتر

source: Recent Drill Tracks
fa_ir: بیت‌های دریل جدید

source: Recent Trap Tracks
fa_ir: بیت‌های ترپ جدید

source: Choose file
fa_ir: انتخاب فایل

source: Delete
fa_ir: حذف

# uploadPageTitle
source: Upload your track
fa_ir: ارسال بیت‌ جدید

# uploadPagePrompt
source: Provide these information to upload your beat.
fa_ir: لطفا برای ارسال بیت جدید جزئیات زیر را وارد کنید.

source: Title
fa_ir: عنوان

# titleRequiredError
source: Please provide a title for your track
fa_ir: لطفا یک عنوان برای اثر خود انتخاب کنید‍.

# uploadPageTitleHint
source: People might search your track with this name.
fa_ir: کاربران با این عنوان برای این بیت جستجو می‌کنند.

# uploadPageGenresHint
source: Click on the field to select genres
fa_ir: برای انتخاب ژانر روی این فیلد کلیک کنید.

# uploadPageTagsHint
source: Helps people to find the track easier
fa_ir: کمک می‌کند تا این بیت راحت تر پیدا شود

source: Description
fa_ir: توضیحات

# uploadPageDescriptionHint
source: Any other kind of information about this track
fa_ir: هر نوع اطلاعات دیگر را در این فیلد می‌توانید اضافه کنید.

# audioFilePickerTitle
source: Audio file
fa_ir: فایل صوتی

# audioFilePickerHint
source: Click to add an .mp3 or .wav audio file
fa_ir: برای انتخاب فایل mp3 یا wav کلیک کنید.

# imageFilePickerTitle
source: Cover art file
fa_ir: فایل تصویر جلد

# imageFilePickerHint
source: Click to add an .jpg or .jpeg image file
fa_ir: برای انتخاب فایل jpg یا jpeg کلیک کنید.

# uploadCTA
source: Upload Now
fa_ir: ارسال بیت

source: Uploading...
fa_ir: در حال آپلود...

source: Cancel
fa_ir: بازگشت

source: Select genres:
fa_ir: انتخاب ژانر:

source: Select tags:
fa_ir: انتخاب ویژگی‌ها:

source: PLease review the form and enter the valid information.
fa_ir: لطفا جزئیات وارد شده را مرور کنید و اطلاعات معتبر وارد کنید.

source: Please select at least one genre!
fa_ir: لطفا حداقل یک ژانر انتخاب کنید.

source: Please add an audio for your track.
fa_ir: لطفا یک فایل صوتی برای بیت‌ خود انتخاب کنید.

source: Please add an image for your track.
fa_ir: لطفا یک تصویر برای بیت‌ خود انتخاب کنید.

source: Something went wrong while uploading the picture! Try again later.
fa_ir: مشکلی در هنگام آپلود تصویر به وجود آمد! لطفاً بعداً دوباره امتحان کنید.

source: Your track submitted successfully!
fa_ir: بیت‌ شما با موفقیت ثبت شد.

# votePageTitle
source: Review Tracks
fa_ir: بررسی بیت‌ها

# votePagePrompt
source: You can decide which tracks have the chance to get published in beatkhor
fa_ir: می‌توانید تصمیم بگیرید که کدام بیت‌ها فرصت منتشر شدن در بیت‌خور را داشته باشند.

source: Confirm
fa_ir: تایید

# multiSelectorDialogPrompt
source: Click on each option to select it:
fa_ir: برای انتخاب هر گزینه روی آن کلیک کنید:

source: Search
fa_ir: جستجو

source: No options found!
fa_ir: گزینه‌ای پیدا نشد!

source: Submit
fa_ir: ثبت

source: You are not allowed to update super user!
fa_ir: شما مجاز به تغییر کاربر مدیر ارشد نیستید!

source: You are sending invalid information!
fa_ir: در حال ارسال اطلاعات نامعتبر هستید.

source: OOps something went wrong! Please try again later.
fa_ir: متاسفانه مشکلی پیش‌ آمده است. لطفا بعدا امتحان کنید.

source: We could not find this item!
fa_ir: پیدا نشد!

source: You are not authorized to access this content!
fa_ir: شما دسترسی به این محتوا را ندارید!

source: Your session is expired. Please login again.
fa_ir: نشست شما منقضی شده است،‌ لطفا دوباره وارد شوید.

source: The OTP is incorrect! Please try again.
fa_ir: کد یکبار مصرف اشتباه وارد شده است. دوباره امتحان کنید.

source: Token is required for this operation!
fa_ir: برای این عمل توکن الزامی است.

source: You can't send a request right now. Please try later!
fa_ir: در حال حاضر نمی‌توانید درخواستی ارسال کنید. لطفاً بعداً دوباره امتحان کنید!

source: Please verify your email first! If you don't have the email try resetting your password
fa_ir: لطفاً ابتدا ایمیل خود را تأیید کنید! اگر ایمیل را دریافت نکردید، تلاش کنید رمز عبور خود را بازنشانی کنید.

source: You can not create duplicated entry!
fa_ir: نمی‌توانید ورودی تکراری ایجاد کنید!

source: This entry is protected!
fa_ir: این داده محافظت شده است!

source: OOps! something went wrong! Please try again later!
fa_ir: مشکلی پیش آمده است! لطفاً بعداً دوباره امتحان کنید.
